# St7GetPlateAverageNormals

Returns whether faceted plates are displayed with averaged normals.

long St7GetPlateAverageNormals(long uID, bool* AverageNormals)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

AverageNormals

True to display plates with averaged normals.